const gas = [
  'ਆਸਾ ਕੀ ਵਾਰ',
  'ਅੰਮ੍ਰਿਤਬਾਣੀਹਰਿਹਰਿਤੇਰੀ॥',
  'ਆਰਤੀ',
  'ਆਵਹੁਸੰਤਮੈਗਲਿਮੇਲਾਈਐ॥',
  'ਗੁਰੁਬੈਠਾਅਮਰੁਸਰੂਪਹੋਇਗੁਰਮੁਖਿਪਾਈਦਾਤਿਇਲਾਹੀ।',
  'ਜੇਤੂਮਿਤ੍ਰੁਅਸਾਡੜਾਹਿਕਭੋਰੀਨਾਵੇਛੋੜਿ॥',
  'ਮਨੁਤਨੁਤੇਰਾਧਨੁਭੀਤੇਰਾ॥',
  'ਰਾਮਰਾਇਹੋਹਿਬੈਦਬਨਵਾਰੀ॥',
  'ਮੁਲਾਂਕਹਹੁਨਿਆਉਖੁਦਾਈ॥',
  'ਨੈਣਮਹਿੰਜੇਤਰਸਦੇਕਦਿਪਸੀਦੀਦਾਰੁ॥੧॥',
  'ਪ੍ਰੇਮਕੀਸਾਰਸੋਈਜਾਣੈਜਿਸਨੋਨਦਰਿਤੁਮਾਰੀਜੀਉ॥੧॥ਰਹਾਉ॥',
  'ਗੁਰਮੁਖਿਜਿਨੀਨਾਮੁਨਪਾਇਆ॥',
  'ਸਤਿਨਾਮੁ ਵਾਹਿਗੁਰੂ',
  'ਸੁਖੀਬਸੈਮਸਕੀਨੀਆਆਪੁਨਿਵਾਰਿਤਲੇ॥',
  'ਸੁਣਿਸੁਣਿਨਾਮੁਤੁਮਾਰਾਪ੍ਰੀਤਮਪ੍ਰਭੁਪੇਖਨਕਾਚਾਉ॥',
  'ਸੁਨੀਐਬਾਜੈਬਾਜਸੁਹਾਵੀ॥',
  'ਹਉਆਇਆਦੂਰਹੁਚਲਿਕੈਮੈਤਕੀਤਉਸਰਣਾਇਜੀਉ॥',
  'ਮਿਲੁਮੇਰੇਪ੍ਰੀਤਮਾਜੀਉਤੁਧੁਬਿਨੁਖਰੀਨਿਮਾਣੀ॥',
  'ਮੋਹਨਘਰਿਆਵਹੁਕਰਉਜੋਦਰੀਆ॥',
  'ਨੈਣਮਹਿੰਜੇਤਰਸਦੇਕਦਿਪਸੀਦੀਦਾਰੁ॥੧॥',
  'ਸੁਖੀਬਸੈਮਸਕੀਨੀਆਆਪੁਨਿਵਾਰਿਤਲੇ॥',
  'ਗੁਰੁਸੁੰਦਰੁਮੋਹਨੁਪਾਇਕਰੇਹਰਿਪ੍ਰੇਮਬਾਣੀਮਨੁਮਾਰਿਆ॥',
  'ਜਾਕੇਸੰਗਤੇਬੀਛੁਰਾਤਾਹੀਕੇਸੰਗਿਲਾਗੁ॥੧੨੯॥',
  'ਮਾਈਮੋਰੋਪ੍ਰੀਤਮੁਰਾਮੁਬਤਾਵਹੁਰੀਮਾਈ॥',
  'ਮੇਰੋਸੁੰਦਰੁਕਹਹੁਮਿਲੈਕਿਤੁਗਲੀ॥',
  'ਸੇਵੀਸਤਿਗੁਰੁਆਪਣਾਹਰਿਸਿਮਰੀਦਿਨਸਭਿਰੈਣ॥',
  'ਸ੍ਵਾਮੀਸਰਨਿਪਰਿਓਦਰਬਾਰੇ॥',
]

const jasbir_s_ji = [
  'ਜੈਤੇਗੰ',
  'ਰਤੇਇਸਕਖੁਦਾਇਰੰਗਿਦੀਦਾਰਕੇ॥',
  'ਸਭੁਤਨੁਮਨੁਹਰਿਆਹੋਇਆਮਨੁਖਿੜਿਆਹਰਿਆਬਾਗੁ॥',
  'ਤਹੀਪ੍ਰਕਾਸਹਮਾਰਾਭਯੋ॥',
]
const bh_jeevan_s = [
  ' ਆਇਪਇਆਤੇਰੀਸਰਣਾਈ॥',
  ' ਧੰਨਜੀਓਤਿਹਕੋਜਗਮੈਮੁਖਤੇਹਰਿਚਿੱਤਮੈਜੁਧੁਬਿਚਾਰੈ॥',
  ' ਅਬਪੂਛੇਕਿਆਕਹਾ॥',
  ' ਬਾਬਾਮਨੁਮਤਵਾਰੋਨਾਮਰਸੁਪੀਵੈਸਹਜਰੰਗਰਚਿਰਹਿਆ॥',
  '',
  ' ਧੰਨਜੀਓਤਿਹਕੋਜਗਮੈਮੁਖਤੇਹਰਿਚਿੱਤਮੈਜੁਧੁਬਿਚਾਰੈ॥',
  ' ਗੁਰਪੂਰੇਕੀਬੇਅੰਤਵਡਾਈ॥੨॥',
  ' ਹਰਿਹਰਿਹਰਿਗੁਨਗਾਵਹੁ॥',
  ' ਹਰਿਹਰਿਨਾਮੁਚਰਾਵਹੁਰੰਗਨਿਆਪੇਹੀਪ੍ਰਭਰੰਗਿ॥੧॥',
  ' ਹਰਿਨਾਮੁਮਿਲਿਆਸੋਹਾਗਣੀਮੇਰੇਗੋਵਿੰਦਾਮਨਿਅਨਦਿਨੁਅਨਦੁਰਹਸੁਜੀਉ॥',
  ' ਹਉਵਾਰਿਵਾਰਿਜਾਉਗੁਰਗੋਪਾਲ॥੧॥ਰਹਾਉ॥',
  ' ਜਰਾਮਰਾਨਹਵਿਆਪਈਫਿਰਿਦੂਖੁਨਪਾਇਆ॥',
  ' ਜਪਹੁਤਏਕੋਨਾਮਾ॥',
  ' ਜਪ੍ਯਉਜਿਨ੍ਹ੍ਹਅਰਜੁਨਦੇਵਗੁਰੂਫਿਰਿਸੰਕਟਜੋਨਿਗਰਭਨਆਯਉ॥੬॥',
  ' ਜੀਵੰਦਿਆਹਰਿਚੇਤਿਆਮਰੰਦਿਆਹਰਿਰੰਗਿ॥',
  ' ਜੋਦੀਸੈਗੁਰਸਿਖੜਾਤਿਸੁਨਿਵਿਨਿਵਿਲਾਗਉਪਾਇਜੀਉ॥',
  ' ਕਰਿਕਿਰਪਾਕਰਹੁਪ੍ਰਭਦਾਤਿ॥',
  ' ਕਰਹੁਕ੍ਰਿਪਾਜਗਜੀਵਨਦਾਤੇਮੇਰਾਮਨੁਹਰਿਸੇਤੀਰਾਚੇ॥',
  ' ਸਭਿਰਾਤੀਸੋਹਾਗਣੀਮੈਡੋਹਾਗਣਿਕਾਈਰਾਤਿਜੀਉ॥੧॥',
  ' ਮੈਮਨਿਵਡੀਆਸਹਰੇਕਿਉਕਰਿਹਰਿਦਰਸਨੁਪਾਵਾ॥',
  ' ਮਿਤ੍ਰਘਣੇਰੇਕਰਿਥਕੀਮੇਰਾਦੁਖੁਕਾਟੈਕੋਇ॥',
  ' ਮਿਤ੍ਰਘਣੇਰੇਕਰਿਥਕੀਮੇਰਾਦੁਖੁਕਾਟੈਕੋਇ॥',
  ' ਢਾਢੀਦਰਿਪ੍ਰਭਮੰਗਣਾਦਰੁਕਦੇਨਛੋੜੇ॥',
  ' ਤੇਰਾਭਰੋਸਾਪਿਆਰੇ॥',
]

const mehar_s_ji = [
  ' ਆਉਹਮਾਰੈਰਾਮਪਿਆਰੇਜੀਉ ॥ ',
  ' ਆਵਹੁਸੰਤਮਿਲਹੁਮੇਰੇਭਾਈਮਿਲਿਹਰਿਹਰਿਕਥਾਕਰਹੁ ॥ ',
  ' ਆਇਮਿਲੁਗੁਰਸਿਖਆਇਮਿਲੁਤੂਮੇਰੇਗੁਰੂਕੇਪਿਆਰੇ ॥ ਰਹਾਉ ॥ ',
  ' ਐਸੋਰਾਮਰਾਇਅੰਤਰਜਾਮੀ ॥ ',
  ' ਅੰਮ੍ਰਿਤੁਪੀਵਹੁਸਦਾਚਿਰੁਜੀਵਹੁਹਰਿਸਿਮਰਤਅਨਦਅਨੰਤਾ ॥ ',
  ' ਅੰਤਰਿਪਿਆਸਉਠੀਪ੍ਰਭਕੇਰੀਸੁਣਿਗੁਰਬਚਨਮਨਿਤੀਰਲਗਈਆ ॥ ',
  ' ਆਸਾ ਦੀ ਵਾਰ ',
  ' ਆਸਾ ਦੀ ਵਾਰ ',
  ' ਬਸੰਤੁ ',
  ' ਭਗਤਸੋਹਹਿਗੁਣਗਾਵਤੇਨਾਨਕਪ੍ਰਭਕੈਦੁਆਰ ॥੬॥ ',
  ' ਮੈਦਰਿਮਾਗਤੁਭੀਖਿਆਪਾਇ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਗੋਬਿੰਦਜੀਉਬਿਖੁਹਉਮੈਮਮਤਾਮੁੰਞੁ ॥ ',
  ' ਗੋਬਿੰਦਜੀਉਮੇਰੇਮਨਤਨਨਾਮਹਰਿਬੀਧੇ ॥ ',
  ' ਅਨਦੁਭਇਆਵਡਭਾਗੀਹੋਗ੍ਰਿਹਿਪ੍ਰਗਟੇਪ੍ਰਭਆਇਜੀਉ ॥ ',
  ' ਗੁਨਕੀਰਤਿਨਿਧਿਮੋਰੀ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਗੁਰੁਗੁਰੁਕਰਤਸਦਾਸੁਖੁਪਾਇਆਗੁਰਚਰਣੀਚਿਤੁਲਾਈਹੇ ॥੨॥ ',
  ' ਗੁਰੁਨਾਨਕੁਜਿਨਸੁਣਿਆਪੇਖਿਆਸੇਫਿਰਿਗਰਭਾਸਿਨਪਰਿਆਰੇ ॥ ',
  ' ਗੁਰੁਨਾਨਕੁਜਿਨਸੁਣਿਆਪੇਖਿਆਸੇਫਿਰਿਗਰਭਾਸਿਨਪਰਿਆਰੇ ॥ ',
  ' ਹਲੇਯਾਰਾਂਹਲੇਯਾਰਾਂਖੁਸਿਖਬਰੀ ॥ ',
  ' ਹਰਿਮੇਰੀਪ੍ਰੀਤਿਰੀਤਿਹੈਹਰਿਮੇਰੀਹਰਿਮੇਰੀਕਥਾਕਹਾਨੀਜੀ ॥ ',
  ' ਹਰਿਰੰਗਿਅਨਦਿਨੁਜਾਗੇ ॥ ',
  ' ਹਰਿਉਤਮੁਹਰਿਪ੍ਰਭੁਗਾਵਿਆਕਰਿਨਾਦੁਬਿਲਾਵਲੁਰਾਗੁ ॥ ',
  ' ਹਉਕੁਰਬਾਨੁਜਾਈਤੇਰੇਨਾਵੈ ॥ ',
  ' ਜਾਗੁਰੇਮਨਜਾਗਨਹਾਰੇ ॥ ',
  ' ਜਬਲਗਖ਼ਾਲਸਾਰਹੇਨਿਆਰਾ ॥ ',
  ' ਜੈਜੈਜਗਕਾਰਣਸ੍ਰਿਸਟਿਉਬਾਰਣਮਮਪ੍ਰਤਿਪਾਰਣਜੈਤੇਗੰ ॥੨॥ ',
  ' ਜੀਵਨਾਸਫਲਜੀਵਨਸੁਨਿਹਰਿਜਪਿਜਪਿਸਦਜੀਵਨਾ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਲਾਲਰੰਗੀਲੇਪ੍ਰੀਤਮਮਨਮੋਹਨਤੇਰੇਦਰਸਨਕਉਹਮਬਾਰੇ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਲੋਇਣਰਤੇਲੋਇਣੀਕੰਨੀਸੁਰਤਿਸਮਾਇ ॥ ',
  ' ਮਾਈਮਨੁਮੇਰੋਬਸਿਨਾਹਿ ॥ ',
  ' ਮਨਿਤਨਿਰਾਮਕੋਬਿਉਹਾਰੁ ॥ ',
  ' ਅੰਤਰਿਪਿਆਸਉਠੀਪ੍ਰਭਕੇਰੀਸੁਣਿਗੁਰਬਚਨਮਨਿਤੀਰਲਗਈਆ ॥ ',
  ' ਮੇਲਿਲੈਹੁਦਇਆਲਢਹਿਪਏਦੁਆਰਿਆ ॥ ',
  ' ਮੁਲਾਂਕਹਹੁਨਿਆਉਖੁਦਾਈ ॥ ',
  ' ਨਾਨਕਜਿਨੑਕਉਸਤਿਗੁਰੁਮਿਲਿਆਤਿਨੑਕਾਲੇਖਾਨਿਬੜਿਆ ॥ ',
  ' ਨਾਨਕਵੈਸਾਖੀਂਪ੍ਰਭੁਪਾਵੈਸੁਰਤਿਸਬਦਿਮਨੁਮਾਨਾ ॥੬॥ ',
  ' ਪੂਤਾਮਾਤਾਕੀਆਸੀਸ ॥ ',
  ' ਰਾਜਲੀਲਾਤੇਰੈਨਾਮਿਬਨਾਈ ॥ ',
  ' ਰਾਖਹੁਰਾਖਨਹਾਰਦਇਆਲਾਨਾਨਕਘਰਕੇਗੋਲੇ ॥ ',
  ' ਸਾਧਸੰਗਤਿਕੈਅੰਚਲਿਲਾਵਹੁ ॥੧॥ ',
  ' ਸਭਨਾਰਾਗਾਂਵਿਚਿਸੋਭਲਾਭਾਈਜਿਤੁਵਸਿਆਮਨਿਆਇ ॥ ',
  ' ਸਾਂਤਿਪਾਈਗੁਰਿਸਤਿਗੁਰਿਪੂਰੇ ॥ ',
  ' ਤਉਮੈਆਇਆਸਰਨੀਆਇਆ ॥ ',
  ' ਤੇਰਾਭਾਣਾਤੂਹੈਮਨਾਇਹਿਜਿਸਨੋਹੋਹਿਦਇਆਲਾ ॥ ',
  ' ਤੇਰਾਜਨੁਨਿਰਤਿਕਰੇਗੁਨਗਾਵੈ ॥ ',
  ' ਤੇਰਾਨਾਮੁਰੂੜੋਰੂਪੁਰੂੜੋਅਤਿਰੰਗਰੂੜੋਮੇਰੋਰਾਮਈਆ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਤੁਝੁਊਪਰਿਮੇਰਾਹੈਮਾਣਾਤੂਹੈਮੇਰਾਤਾਣਾਰਾਮ ॥ ',
  ' ਤੁਮੑਕਰਹੁਦਇਆਮੇਰੇਸਾਈ ॥ ',
  ' ਤੁਮੑਕਰਹੁਦਇਆਮੇਰੇਸਾਈ ॥ ',
  ' ਯਾਰਵੇਨਿਤਸੁਖਸੁਖੇਦੀਸਾਮੈਪਾਈ ॥ ',
]

const sdo = [
  ' ਆਏਸੰਤਪਰਾਹੁਣੇਕੀਰਤਨੁਹੋਆਰੈਣਿਸਬਾਈ ॥ ',
  ' ਐਸੀਕਿਰਪਾਮੋਹਿਕਰਹੁ ॥ ',
  ' ਆਵਹੁਸੰਤਮਿਲਹੁਮੇਰੇਭਾਈਮਿਲਿਹਰਿਹਰਿਕਥਾਕਰਹੁ ॥ ',
  ' ਆਇਮਿਲੁਗੁਰਸਿਖਆਇਮਿਲੁਤੂਮੇਰੇਗੁਰੂਕੇਪਿਆਰੇ ॥ ਰਹਾਉ ॥ ',
  ' ਐਸਾਜਗੁਦੇਖਿਆਜੂਆਰੀ ॥ ',
  ' ਐਸਾਗਿਆਨੁਬੀਚਾਰੈਕੋਈ ॥ ',
  ' ਐਸੇਗੁਰਕਉਬਲਿਬਲਿਜਾਈਐਆਪਿਮੁਕਤੁਮੋਹਿਤਾਰੈ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਆਸਾ ਦੀ ਵਾਰ ',
  ' ਆਸਾ ਦੀ ਵਾਰ ',
  ' ਆਸਾ ਦੀ ਵਾਰ ',
  ' ਅੰਮ੍ਰਿਤਬਚਨਸਤਿਗੁਰਕੀਬਾਣੀਜੋਬੋਲੈਸੋਮੁਖਿਅੰਮ੍ਰਿਤੁਪਾਵੈ ॥੨॥ ',
  ' ਅੰਮ੍ਰਿਤੁਹਰਿਕਾਨਾਮੁਤਿਨੑੀਜਨੀਜਪਿਲਇਆ ॥੬॥ ',
  ' ਅੰਮ੍ਰਿਤਨਾਮੁਸੁਆਮੀਤੇਰਾਜੋਪੀਵੈਤਿਸਹੀਤ੍ਰਿਪਤਾਸ ॥ ',
  ' ਅੰਮ੍ਰਿਤਨਾਮੁਸੁਆਮੀਤੇਰਾਜੋਪੀਵੈਤਿਸਹੀਤ੍ਰਿਪਤਾਸ ॥ ',
  ' ਅੰਮ੍ਰਿਤੁਰਸੁਪੀਆਗੁਰਸਬਦੀਹਮਨਾਮਵਿਟਹੁਕੁਰਬਾਨ ॥੧॥ ',
  ' ਆਨੰਦੁਆਨੰਦੁਸਭੁਕੋਕਹੈਆਨੰਦੁਗੁਰੂਤੇਜਾਣਿਆ ॥ ',
  ' ਆਨੰਦੁਆਨੰਦੁਸਭੁਕੋਕਹੈਆਨੰਦੁਗੁਰੂਤੇਜਾਣਿਆ ॥ ',
  ' ਅਪਨੇਕਾਜਕਉਕਿਉਅਲਕਾਈਐ ॥ ',
  ' ਅਪਨੇਪ੍ਰਭਸਿਉਹੋਹੁਸਾਵਧਾਨੁ ॥ ',
  ' ਅਪਨੇਪ੍ਰਭਸਿਉਹੋਹੁਸਾਵਧਾਨੁ ॥ ',
  ' ਅਪਨੇਸਤਿਗੁਰਕੀਵਡਿਆਈ ॥ ',
  ' ਭਗਤਾਕਾਸਹਾਈਜੁਗਿਜੁਗਿਜਾਣਿਆ॥੩॥ ',
  ' ਭਜੁਮਨਮੇਰੇਏਕੋਨਾਮ ॥ ',
  ' ਭਿੰਨੀਰੈਨੜੀਐਚਾਮਕਨਿਤਾਰੇ ॥ ',
  ' ਭਿੰਨੀਰੈਨੜੀਐਚਾਮਕਨਿਤਾਰੇ ॥ ',
  ' ਭਿੰਨੀਰੈਨੜੀਐਚਾਮਕਨਿਤਾਰੇ ॥ ',
  ' ਭਿੰਨੀਰੈਨੜੀਐਚਾਮਕਨਿਤਾਰੇ ॥ ',
  ' ਭਿੰਨੀਰੈਨੜੀਐਚਾਮਕਨਿਤਾਰੇ ॥ ',
  ' ਬਿਖੁਤੇਅੰਮ੍ਰਿਤੁਹੁਯਉਨਾਮੁਸਤਿਗੁਰਮੁਖਿਭਣਿਅਉ ॥ ',
  ' ਬਿਖਮੋਬਿਖਮੁਅਖਾੜਾਮੈਗੁਰਮਿਲਿਜੀਤਾਰਾਮ ॥ ',
  ' ਬਿਨੁਏਕਨਾਮੁਇਕਚਿੱਤਲੀਨ ॥ ',
  ' ਚਰਨਕਮਲਜਾਕੈਰਿਦੈਬਸਹਿਸੋਜਨੁਕਿਉਡੋਲੈਦੇਵ ॥ ',
  ' ਚੌਪਈ ॥ ',
  ' ਚਿੜੀਚੁਹਕੀਪਹੁਫੁਟੀਵਗਨਿਬਹੁਤੁਤਰੰਗ ॥ ',
  ' ਦੇਹਿਅਸੀਸਕਹੈਂਜਗਦੀਸਇਹਜੋਰੀਜਿਯੋਜੁਗਚਾਰਿਤਿਹਾਰੀ ॥੧੧॥ ',
  ' ਦੇਹੁਸਜਣਅਸੀਸੜੀਆਜਿਉਹੋਵੈਸਾਹਿਬਸਿਉਮੇਲੁ ॥੩॥ ',
  ' ਧੰਨੁਸੁਵੇਲਾਜਿਤੁਮੈਸਤਿਗੁਰੁਮਿਲਿਆ ॥ ',
  ' ਦੁਖੀਦੁਨੀਸਹੇੜੀਐਜਾਇਤਲਗਹਿਦੁਖ ॥ ',
  ' ਦੂਜੀਕਾਰੈਲਗਿਜਨਮੁਗਵਾਈਐ ॥ ',
  ' ਦੂਜੀਕਾਰੈਲਗਿਜਨਮੁਗਵਾਈਐ ॥ ',
  ' ਏਮਨਮੇਰਿਆਤੂਸਮਝੁਅਚੇਤਇਆਣਿਆਰਾਮ ॥ ',
  ' ਗੋਬਿੰਦਮਿਲਣਕੀਇਹਤੇਰੀਬਰੀਆ ॥ ',
  ' ਇਹੁਮਨੁਹਰਿਕੈਨਾਮਿਉਧਾਰਨਾ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਇਉਂਉਠਭਬਕੇਬਲਬੀਰਸਿੰਘਸ਼ਸਤਰਝਮਕਾਏ ॥ ',
  ' ਏਕਾਏਕੰਕਾਰੁਲਿਖਿਦੇਖਾਲਿਆ । ',
  ' ਏਕਾਏਕੰਕਾਰੁਲਿਖਿਦੇਖਾਲਿਆ । ',
  ' ਏਕਾਏਕੰਕਾਰੁਲਿਖਿਦੇਖਾਲਿਆ । ',
  ' ਗੋਬਿੰਦਜੀਉਮੇਰੇਮਨਤਨਨਾਮਹਰਿਬੀਧੇ ॥ ',
  ' ਗੋਬਿੰਦਗੁਣਗਾਵਣਲਾਗੇ ॥ ',
  ' ਗੁਰੁਮੰਤ੍ਰੁਦ੍ਰਿੜਾਏਹਰਿਰਸਕਿਰਸਾਏਹਰਿਅੰਮ੍ਰਿਤੁਹਰਿਮੁਖਿਚੋਇਜੀਉ ॥ ',
  ' ਗੁਰਸਤਿਗੁਰਕਾਜੋਸਿਖੁਅਖਾਏਸੁਭਲਕੇਉਠਿਹਰਿਨਾਮੁਧਿਆਵੈ ॥ ',
  ' ਗੁਰਸਤਿਗੁਰਕਾਜੋਸਿਖੁਅਖਾਏਸੁਭਲਕੇਉਠਿਹਰਿਨਾਮੁਧਿਆਵੈ ॥ ',
  ' ਗੁਰਸਤਿਗੁਰਵਿਚਿਨਾਵੈਕੀਵਡੀਵਡਿਆਈਹਰਿਕਰਤੈਆਪਿਵਧਾਈ ॥ ',
  ' ਗੁਰਬਾਣੀਸੁਣਿਮੈਲੁਗਵਾਏ ॥ ',
  ' ਗੁਰਬਾਣੀਸੁਣਿਮੈਲੁਗਵਾਏ ॥ ',
  ' ਗੁਰਬਾਣੀਸੁਣਿਮੈਲੁਗਵਾਏ ॥ ',
  ' ਗੁਰਦੇਵਮਾਤਾਗੁਰਦੇਵਪਿਤਾਗੁਰਦੇਵਸੁਆਮੀਪਰਮੇਸੁਰਾ ॥ ',
  ' ਗੁਰਮੁਖਿਚਾਲਚਲਾਇਹਾਲਪੁਜਾਇਆ । ',
  ' ਗੁਰਮੁਖਿਨਾਮੁਸੁਨਹੁਮੇਰੀਭੈਨਾ ॥  ',
  ' ਗੁਰਸਿਖੀਬਾਰੀਕਹੈਖੰਡੇਧਾਰਗਲੀਅਤਿਭੀੜੀ । ',
  ' ਗੁਰਸਿਖੀਬਾਰੀਕਹੈਸਿਲਚਟਣੁਫਿਕੀ । ',
  ' ਹੈਕੋਈਰਾਮਪਿਆਰੋਗਾਵੈ ॥ ',
  ' ਹਮਧਨਵੰਤਭਾਗਠਸਚਨਾਇ ॥ ',
  ' ਹਮਧਨਵੰਤਭਾਗਠਸਚਨਾਇ ॥ ',
  ' ਹਮਇਹਕਾਜਜਗਤਮੋਆਏ ॥ ',
  ' ਹਰਿਹਰਿਨਾਮੁਅੰਤਰਿਉਰਿਧਾਰਿ ॥ ',
  ' ਹਰਿਹਰਿਨਾਮੁਨਿਧਾਨੁਹੈਗੁਰਮੁਖਿਪਾਇਆਜਾਇ ॥ ',
  ' ਹਰਿਜਨਦੇਖਹੁਸਤਿਗੁਰੁਨੈਨੀ ॥ ',
  ' ਹਰਿਜਨਕਉਇਹੀਸੁਹਾਵੈ ॥ ',
  ' ਹਰਿਕੇਨਾਮਬਿਨੁਝੂਠੇਸਗਲਪਾਸਾਰੇ ॥੧॥ ਰਹਾਉ ॥ ',
  ' ਹਰਿਕੇਨਾਮਕੀਵਡਿਆਈ ॥ ',
  ' ਹਰਿਕੇਨਾਮਕੀਵਡਿਆਈ ॥ ',
  ' ਹਰਿਕੀਰਤਨੁਗਾਵਹੁਦਿਨੁਰਾਤੀਸਫਲਏਹਾਹੈਕਾਰੀਜੀਉ ॥੩॥ ',
  ' ਹਰਿਲਬਧੋਮਿਤ੍ਰਸੁਮਿਤੋ ॥ ',
  ' ਹਰਿਮੇਰੀਪ੍ਰੀਤਿਰੀਤਿਹੈਹਰਿਮੇਰੀਹਰਿਮੇਰੀਕਥਾਕਹਾਨੀਜੀ ॥ ',
  ' ਹਰਿਮੇਰੀਪ੍ਰੀਤਿਰੀਤਿਹੈਹਰਿਮੇਰੀਹਰਿਮੇਰੀਕਥਾਕਹਾਨੀਜੀ ॥ ',
  ' ਹਰਿਰਾਮਨਾਮੁਜਪਿਲਾਹਾ ॥ ',
  ' ਹਰਿਰਾਮਨਾਮੁਜਪਿਲਾਹਾ ॥ ',
  ' ਹਰਿਰਾਮਨਾਮੁਜਪਿਲਾਹਾ ॥ ',
  ' ਕਿਉਰਹੀਐਥਿਰੁਜਗਿਕੋਕਢਹੁਉਪਾਇਆ ॥ ',
  ' ਸੇਵੀਸਤਿਗੁਰੁਆਪਣਾਹਰਿਸਿਮਰੀਦਿਨਸਭਿਰੈਣ ॥ ',
  ' ਸੇਵੀਸਤਿਗੁਰੁਆਪਣਾਹਰਿਸਿਮਰੀਦਿਨਸਭਿਰੈਣ ॥ ',
  ' ਹਰਿਹਾਂਮਸਤਕਿਹੋਵੈਭਾਗੁਤਸਾਜਨੁਪਾਈਐ ॥੨॥ ',
  ' ਹਉਭਾਲਿਵਿਕੁੰਨੀਹੋਈ ॥ ',
  ' ਹਉਭਈਉਡੀਣੀਕੰਤਕਉਅੰਮਾਲੀਸੋਪਿਰੁਕਦਿਨੈਣੀਦੇਖਾ ॥ ',
  ' ਇਕਿਖੜੇਕਰਹਿਤੇਰੀਚਾਕਰੀਵਿਣੁਨਾਵੈਹੋਰੁਨਭਾਇਆ ॥ ',
  ' ਇਕਿਖੜੇਕਰਹਿਤੇਰੀਚਾਕਰੀਵਿਣੁਨਾਵੈਹੋਰੁਨਭਾਇਆ ॥ ',
  ' ਇਕਿਨਚਿਨਚਿਪੂਰਹਿਤਾਲਭਗਤਿਨਕੀਜਈ ॥ ',
  ' ਜਾਕੈਕੀਐਸ੍ਰਮੁਕਰੈਤੇਬੈਰਬਿਰੋਧੀ ॥ ',
  ' ਜਾਹਰਪੀਰਜਗਤੁਗੁਰੁਬਾਬਾ ॥੩॥ ',
  ' ਜਪਹੁਤਏਕੋਨਾਮਾ ॥ ',
  ' ਜਿਨਗੁਰਮੁਖਿਖੋਜਿਢੰਢੋਲਿਆਤਿਨਅੰਦਰਹੁਹੀਸਚੁਲਾਧਿਆ ॥ ',
  ' ਜਨੁਨਾਨਕੁਧੂੜਿਮੰਗੈਤਿਸੁਗੁਰਸਿਖਕੀਜੋਆਪਿਜਪੈਅਵਰਹਨਾਮੁਜਪਾਵੈ ॥੨॥ ',
  ' ਜੋਜੋਦੀਸੈਸੋਸੋਰੋਗੀ ॥ ',
  ' ਜੋਜੋਦੀਸੈਸੋਸੋਰੋਗੀ ॥ ',
  ' ਕਬੀਰਸੂਤਾਕਿਆਕਰਹਿਉਠਿਕਿਨਜਪਹਿਮੁਰਾਰਿ ॥ ',
  ' ਕਹਾਚਲਹੁਮਨਰਹਹੁਘਰੇ ॥ ',
  ' ਕਹੁਬੇਨੰਤੀਅਪੁਨੇਸਤਿਗੁਰਪਾਹਿ ॥ ',
  ' ਕੰਤਾਤੂਸਉਸੇਜੜੀਮੈਡਾਹਭੋਦੁਖੁਉਲਾਹਿ ॥੨॥ ',
  ' ਕੰਤਾਤੂਸਉਸੇਜੜੀਮੈਡਾਹਭੋਦੁਖੁਉਲਾਹਿ ॥੨॥ ',
  ' ਖਿਨਮਹਿਥਾਪਿਉਥਾਪਨਹਾਰਾ ॥ ',
  ' ਏਸਰੀਰਾਮੇਰਿਆਇਸੁਜਗਮਹਿਆਇਕੈਕਿਆਤੁਧੁਕਰਮਕਮਾਇਆ ॥ ',
  ' ਕਿਉਰਹੀਐਥਿਰੁਜਗਿਕੋਕਢਹੁਉਪਾਇਆ ॥ ',
  ' ਕ੍ਰਿਪਾਕ੍ਰਿਪਾਕਰਿਗੁਰੂਮਿਲਾਏਹਮਪਾਹਨਸਬਦਿਗੁਰਤਾਰੇ ॥੧॥ ਰਹਾਉ ॥ ',
  ' Kirtan + Rehras ',
  ' ਕੋਈਆਵੈਸੰਤੋਹਰਿਕਾਜਨੁਸੰਤੋਮੇਰਾਪ੍ਰੀਤਮਜਨੁਸੰਤੋਮੋਹਿਮਾਰਗੁਦਿਖਲਾਵੈ ॥ ',
  ' ਕੋਊਜਾਗੈਹਰਿਜਨੁ ॥੧॥ ',
  ' ਕੋਊਜਾਗੈਹਰਿਜਨੁ ॥੧॥ ',
  ' ਮਾਈਮਨੁਮੇਰੋਬਸਿਨਾਹਿ ॥ ',
  ' ਮਾਈਮਨੁਮੇਰੋਬਸਿਨਾਹਿ ॥ ',
  ' ਮਾਈਰੀਮਨੁਮੇਰੋਮਤਵਾਰੋ ॥ ',
  ' ਮੈਮਨੁਤਨੁਖੋਜਿਖੋਜੇਦਿਆਸੋਪ੍ਰਭੁਲਧਾਲੋੜਿ ॥ ',
  ' ਮਨਮਿਲਿਸੰਤਜਨਾਜਸੁਗਾਇਓ ॥ ',
  ' ਮਨਰੇਥਿਰੁਰਹੁਮਤੁਕਤਜਾਹੀਜੀਉ ॥ ',
  ' ਪਿਆਰੇਇਨਬਿਧਿਮਿਲਣੁਨਜਾਈਮੈਕੀਏਕਰਮਅਨੇਕਾ ॥ ',
  ' ਮੀਠੀਪਿਰਹਿਕਹਾਨੀ ॥ ',
  ' ਮੀਠੀਪਿਰਹਿਕਹਾਨੀ ॥ ',
  ' ਮੇਰਾਮਨੁਲਾਗਾਹੈਰਾਮਪਿਆਰੇ ॥ ',
  ' ਮੇਰਾਮਨੁਲਾਗਾਹੈਰਾਮਪਿਆਰੇ ॥ ',
  ' ਮੇਰੇਮਨਸਾਧਸਰਣਿਛੁਟਕਾਰਾ ॥ ',
  ' ਮੇਰੇਰਾਮਹਮਪਾਪੀਸਰਣਿਪਰੇਹਰਿਦੁਆਰਿ ॥ ',
  ' ਮੇਰੇਰਾਮਹਮਪਾਪੀਸਰਣਿਪਰੇਹਰਿਦੁਆਰਿ ॥ ',
  ' ਮੇਰੇਪ੍ਰੀਤਮਾਹਉਜੀਵਾਨਾਮੁਧਿਆਇ ॥ ',
  ' ਮੇਰੇਠਾਕੁਰਪੂਰੈਤਖਤਿਅਡੋਲੁ ॥ ',
  ' ਵਣੁਤ੍ਰਿਣੁਸਭੁਆਕਾਰੁਹੈਮੇਰੀਜਿੰਦੁੜੀਏਮੁਖਿਹਰਿਹਰਿਨਾਮੁਧਿਆਵੈਰਾਮ ॥ ',
  ' ਮਿਲਿਰਹੀਐਪ੍ਰਭਸਾਧਜਨਾਮਿਲਿਹਰਿਕੀਰਤਨੁਸੁਨੀਐਰਾਮ ॥ ',
  ' ਮਿਲੁਮੇਰੇਪ੍ਰੀਤਮਾਜੀਉਤੁਧੁਬਿਨੁਖਰੀਨਿਮਾਣੀ ॥ ',
  ' ਮਿਲੁਮੇਰੇਪ੍ਰੀਤਮਾਜੀਉਤੁਧੁਬਿਨੁਖਰੀਨਿਮਾਣੀ ॥ ',
  ' ਮਿਲੁਮੇਰੇਪ੍ਰੀਤਮਾਜੀਉਤੁਧੁਬਿਨੁਖਰੀਨਿਮਾਣੀ ॥ ',
  ' ਮਿਲਿਰਹੀਐਪ੍ਰਭਸਾਧਜਨਾਮਿਲਿਹਰਿਕੀਰਤਨੁਸੁਨੀਐਰਾਮ ॥ ',
  ' ਮਿਲਿਰਹੀਐਪ੍ਰਭਸਾਧਜਨਾਮਿਲਿਹਰਿਕੀਰਤਨੁਸੁਨੀਐਰਾਮ ॥ ',
  ' ਮਿਲਹੁਪਿਆਰੇਜੀਆ ॥ ',
  ' ਮਿਟਿਗਈਭਾਲਮਨੁਸਹਜਿਸਮਾਨਾ ॥ ',
  ' ਨਾਕੋਦੁਸਮਨੁਦੋਖੀਆਨਾਹੀਕੋਮੰਦਾ ॥ ',
  ' ਨਾਮੁਕਹਤਗੋਵਿੰਦਕਾਸੂਚੀਭਈਰਸਨਾ ॥ ',
  ' ਨਾਮੁਨਿਰੰਜਨਅਲਖੁਹੈਕਿਉਲਖਿਆਜਾਈ ॥ ',
  ' ਨੈਨਰਹੇਰੰਗੁਲਾਈ ॥ ',
  ' ਓਅੰਪ੍ਰਿਅਪ੍ਰੀਤਿਚੀਤਿਪਹਿਲਰੀਆ ॥ ',
  ' ਊਠਤਬੈਠਤਸੋਵਤਧਿਆਈਐ ॥ ',
  ' ਪਾਰਬ੍ਰਹਮੁਤਿਨਕੰਉਸੰਤੁਸਟੁਭਇਆਜੋਗੁਰਚਰਨੀਜਨਪਾਹਿ ॥ ',
  ' Panth Khalsa Khethi Meri ',
  ' ਪਰਦੇਸੁਝਾਗਿਸਉਦੇਕਉਆਇਆ ॥ ',
  ' ਪਰਦੇਸੁਝਾਗਿਸਉਦੇਕਉਆਇਆ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਆਰੇਹਰਿਬਿਨੁਪ੍ਰੇਮੁਨਖੇਲਸਾ ॥ ',
  ' ਪਿਛਲੇਗੁਨਹਬਖਸਾਇਜੀਉਅਬਤੂਮਾਰਗਿਪਾਇ ॥ ',
  ' ਪੂਤਾਮਾਤਾਕੀਆਸੀਸ ॥ ',
  ' ਪੋਥੀਪਰਮੇਸਰਕਾਥਾਨੁ ॥ ',
  ' ਪ੍ਰਭਮਿਲਣੈਕੀਏਹਨੀਸਾਣੀ ॥ ',
  ' ਪ੍ਰਿਅਰੰਗਦੇਖੈਜਪਤੀਨਾਮੁਨਿਧਾਨੀ ॥ ਰਹਾਉ ॥ ',
  ' ਰਾਮਨਾਮਜਪਿਏਕੰਕਾਰੁ ॥ ',
  ' ਰਾਮਰਸੁਪੀਆਰੇ ॥ ',
  ' ਰੇਮਨਮੇਰੇਤੂੰਹਰਿਸਿਉਜੋਰੁ ॥ ',
  ' ਰੇਮਨਮੂੜਸਿਮਰਿਸੁਖਦਾਤਾਨਾਨਕਦਾਸਤੁਝਹਿਸਮਝਾਵਤ ॥੭॥ ',
  ' Rehraas Sahib ',
  ' Rehraas Sahib ',
  ' ਸਾਧਸੰਗਤਿਕੈਆਸਰੈਪ੍ਰਭਸਿਉਰੰਗੁਲਾਏ ॥ ',
  ' ਸਾਂਗੈਅੰਦਰਿਸਾਬਤਾਜਿਸੁਗੁਰੂਸਹਾਏ ॥ ',
  ' ਸਭੁਕੋਤੇਰੈਵਸਿਅਗਮਅਗੋਚਰਾ ॥ ',
  ' ਸਭਿਆਖਹੁਸਤਿਗੁਰੁਵਾਹੁਵਾਹੁਜਿਨਿਦਾਨੁਹਰਿਨਾਮੁਮੁਖਿਦੀਆ ॥੧॥ ',
  ' ਸਭਿਆਖਹੁਸਤਿਗੁਰੁਵਾਹੁਵਾਹੁਜਿਨਿਦਾਨੁਹਰਿਨਾਮੁਮੁਖਿਦੀਆ ॥੧॥ ',
  ' ਸਭਿਆਖਹੁਸਤਿਗੁਰੁਵਾਹੁਵਾਹੁਜਿਨਿਦਾਨੁਹਰਿਨਾਮੁਮੁਖਿਦੀਆ ॥੧॥ ',
  ' ਸਭਿਧਿਆਵਹੁਆਦਿਸਤੇਜੁਗਾਦਿਸਤੇਪਰਤਖਿਸਤੇਸਦਾਸਦਾਸਤੇਜਨੁਨਾਨਕੁਦਾਸੁਦਸੋਨਾ ॥੫॥ ',
  ' ਸਭੁਕਿਛੁਪੂਰਾਹਿਰਦੈਨਾਮੁ ॥੧॥ ',
  ' ਸਭਨਾਉਪਾਵਾਸਿਰਿਉਪਾਉਹੈਹਰਿਨਾਮੁਪਰਾਪਤਿਹੋਇ ॥ ',
  ' ਸਦਾਰੰਗਿਰਾਤੇਤੇਰਚਾਏ ॥ ',
  ' ਸਾਧਸੰਗਤਿਅਸਥਾਨੁਜਗਮਗਨੂਰਹੈ । ',
  ' ਸਾਈਨਾਮੁਅਮੋਲੁਕੀਮਨਕੋਈਜਾਣਦੋ ॥ ',
  ' ਸਾਹਿਬੁਨਿਤਾਣਿਆਕਾਤਾਣੁ ॥ ',
  ' ਸਾਜਨਮੇਰੇਪ੍ਰੀਤਮਹੁਤੁਮਸਹਕੀਭਗਤਿਕਰੇਹੋ ॥ ',
  ' ਸਖੀਸਹੇਲੀਭਏਅਨੰਦਾਗੁਰਿਕਾਰਜਹਮਰੇਪੂਰੇ ॥ ',
  ' ਸੰਤਨਕੈਸੁਨੀਅਤਪ੍ਰਭਕੀਬਾਤ ॥ ',
  ' ਸਤਿਗੁਰਆਗੈਸੀਸੁਭੇਟਦੇਉਜੇਸਤਿਗੁਰਸਾਚੇਭਾਵੈ ॥ ',
  ' ਸਤਿਗੁਰੁਮੇਰਾਸਦਾਸਦਾਨਾਆਵੈਨਜਾਇ ॥ ',
  ' ਸਤਿਗੁਰੁਪੁਰਖੁਮਿਲਾਇਅਵਗਣਵਿਕਣਾਗੁਣਰਵਾਬਲਿਰਾਮਜੀਉ ॥ ',
  ' ਸਤਿਗੁਰਕੀਸੇਵਾਗਾਖੜੀਸਿਰੁਦੀਜੈਆਪੁਗਵਾਇ ॥ ',
  ' ਸਤਸੰਗਤਿਸਤਿਗੁਰਧੰਨੁਧਨੋੁਧੰਨਧੰਨਧਨੋਜਿਤੁਮਿਲਿਹਰਿਬੁਲਗਬੁਲੋਗੀਆ ॥ ',
  ' ਸੇਸੰਜੋਗਕਰਹੁਮੇਰੇਪਿਆਰੇ ॥ ',
  ' ਸੀਸੁਦੀਆਪਰੁਸੀਨਉਚਰੀ ॥੧੩॥ ',
  ' So Guru Gobind Har Ka Roopna ',
  ' ਸੋਕਿਛੁਕਰਿਜਿਤੁਛੁਟਹਿਪਰਾਨੀ ॥ ',
  ' ਸੋਕਿਛੁਕਰਿਜਿਤੁਛੁਟਹਿਪਰਾਨੀ ॥ ',
  ' ਧੰਨੁਸੁਵੇਲਾਜਿਤੁਮੈਸਤਿਗੁਰੁਮਿਲਿਆਸੋਸਹੁਚਿਤਿਆਇਆ ॥ ',
  ' ਸੁਣਿਯਾਰਹਮਾਰੇਸਜਣਇਕਕਰਉਬੇਨੰਤੀਆ ॥ ',
  ' ਸੁਨੀਐਬਾਜੈਬਾਜਸੁਹਾਵੀ ॥ ',
  ' ਸੁਨੀਐਬਾਜੈਬਾਜਸੁਹਾਵੀ ॥ ',
  ' Tegh Bahadar Sat Saroopna ',
  ' ਏਮਨਪਿਆਰਿਆਤੂਸਦਾਸਚੁਸਮਾਲੇ ॥ ',
  ' ਸੰਤਜਨਾਕੀਜਾਤਿਹਰਿਸੁਆਮੀਤੁਮੑਠਾਕੁਰਹਮਸਾਂਗੀ ॥ ',
  ' ਵਾਹਵਾਹਗੋਬਿੰਦਸਿੰਘਆਪੇਗੁਰੁਚੇਲਾ ॥੧॥ ',
  ' ਵਾਹੁਖਸਮਤੂਵਾਹੁਜਿਨਿਰਚਿਰਚਨਾਹਮਕੀਏ ॥ ',
  ' ਵਿਰਲੇਹੀਸਨਮੁਖਭਾਣਾਭਾਇਆ ॥੮॥ ',
]

const talwara = [' ਆਦਿਗੁਰਏਨਮਹ ॥ ', ' ਐਥੈਓਥੈਮੁਕਤਿਹੈਜਿਨਰਾਮਪਛਾਣੇ ॥ ']

const SGGS_lst = require('./SGGS_n_Vaaraa.json')
function findNonLarivaar(larivaarPangti) {
  const lp = larivaarPangti.trim()

  const noPangtiLine = ['ਜੈਤੇਗੰ', 'ਬਸੰਤੁ', 'ਆਸਾ ਦੀ ਵਾਰ']
  if (noPangtiLine.includes(lp)) {
    return lp
  }

  const similarPangtis = []
  for (let i = 0; i < SGGS_lst.length; i++) {
    const pcP = SGGS_lst[i].replaceAll(' ', '').trim()
    if (pcP === lp) {
      // console.log("perfect match found!", pcP)
      return pcP
    }
    const diff = getStringDifference(pcP, lp)
    if (diff < 10) {
      similarPangtis.push({
        line: SGGS_lst[i],
        diff: diff,
      })
    }
  }

  if (similarPangtis.length > 0) {
    // console.log(similarPangtis.length," matches found for: ", larivaarPangti)
    // console.log(similarPangtis)

    let minn = similarPangtis[0].diff
    let line = similarPangtis[0].line
    for (let i = 0; i < similarPangtis.length; i++) {
      if (similarPangtis[i].diff < minn) {
        minn = similarPangtis[i].diff
        line = similarPangtis[i].line
      }
    }
    return line
  }
  return null
}

function getStringDifference(stringA, stringB) {
  let cost = []
  let str1 = stringA
  let str2 = stringB
  let n = str1.length
  let m = str2.length
  let i
  let j

  let minimum = function (a, b, c) {
    let min = a
    if (b < min) {
      min = b
    }
    if (c < min) {
      min = c
    }
    return min
  }

  if (n == 0) {
    return
  }
  if (m == 0) {
    return
  }

  for (let i = 0; i <= n; i++) {
    cost[i] = []
  }

  for (i = 0; i <= n; i++) {
    cost[i][0] = i
  }

  for (j = 0; j <= m; j++) {
    cost[0][j] = j
  }

  for (i = 1; i <= n; i++) {
    let x = str1.charAt(i - 1)

    for (j = 1; j <= m; j++) {
      let y = str2.charAt(j - 1)

      if (x == y) {
        cost[i][j] = cost[i - 1][j - 1]
      } else {
        cost[i][j] =
          1 + minimum(cost[i - 1][j - 1], cost[i][j - 1], cost[i - 1][j])
      }
    } //endfor
  } //endfor

  return cost[n][m]
}

const theLst = talwara

const newGurmukhiTitle = []
let notFound = 0
for (let i = 0; i < theLst.length; i++) {
  const padChed_line = findNonLarivaar(theLst[i])
  if (padChed_line) {
    newGurmukhiTitle.push(padChed_line)
  } else {
    console.log('Not Found: ', theLst[i])
    newGurmukhiTitle.push(theLst[i])
    notFound++
  }
}

console.log('Not Found: ', notFound)
const fs = require('fs')
fs.writeFileSync('links.json', JSON.stringify(newGurmukhiTitle, null, 2))
