const gurmukhiTitle = [
  'ਆਸਾ ਕੀ ਵਾਰ',
  'ਅੰਮ੍ਰਿਤਬਾਣੀਹਰਿਹਰਿਤੇਰੀ॥',
  'ਆਰਤੀ',
  'ਆਵਹੁਸੰਤਮੈਗਲਿਮੇਲਾਈਐ॥',
  'ਗੁਰੁਬੈਠਾਅਮਰੁਸਰੂਪਹੋਇਗੁਰਮੁਖਿਪਾਈਦਾਤਿਇਲਾਹੀ।',
  'ਜੇਤੂਮਿਤ੍ਰੁਅਸਾਡੜਾਹਿਕਭੋਰੀਨਾਵੇਛੋੜਿ॥',
  'ਮਨੁਤਨੁਤੇਰਾਧਨੁਭੀਤੇਰਾ॥',
  'ਰਾਮਰਾਇਹੋਹਿਬੈਦਬਨਵਾਰੀ॥',
  'ਮੁਲਾਂਕਹਹੁਨਿਆਉਖੁਦਾਈ॥',
  'ਨੈਣਮਹਿੰਜੇਤਰਸਦੇਕਦਿਪਸੀਦੀਦਾਰੁ॥੧॥',
  'ਪ੍ਰੇਮਕੀਸਾਰਸੋਈਜਾਣੈਜਿਸਨੋਨਦਰਿਤੁਮਾਰੀਜੀਉ॥੧॥ਰਹਾਉ॥',
  'ਗੁਰਮੁਖਿਜਿਨੀਨਾਮੁਨਪਾਇਆ॥',
  'ਸਤਿਨਾਮੁ ਵਾਹਿਗੁਰੂ',
  'ਸੁਖੀਬਸੈਮਸਕੀਨੀਆਆਪੁਨਿਵਾਰਿਤਲੇ॥',
  'ਸੁਣਿਸੁਣਿਨਾਮੁਤੁਮਾਰਾਪ੍ਰੀਤਮਪ੍ਰਭੁਪੇਖਨਕਾਚਾਉ॥',
  'ਸੁਨੀਐਬਾਜੈਬਾਜਸੁਹਾਵੀ॥',
  'ਹਉਆਇਆਦੂਰਹੁਚਲਿਕੈਮੈਤਕੀਤਉਸਰਣਾਇਜੀਉ॥',
  'ਮਿਲੁਮੇਰੇਪ੍ਰੀਤਮਾਜੀਉਤੁਧੁਬਿਨੁਖਰੀਨਿਮਾਣੀ॥',
  'ਮੋਹਨਘਰਿਆਵਹੁਕਰਉਜੋਦਰੀਆ॥',
  'ਨੈਣਮਹਿੰਜੇਤਰਸਦੇਕਦਿਪਸੀਦੀਦਾਰੁ॥੧॥',
  'ਸੁਖੀਬਸੈਮਸਕੀਨੀਆਆਪੁਨਿਵਾਰਿਤਲੇ॥',
  'ਗੁਰੁਸੁੰਦਰੁਮੋਹਨੁਪਾਇਕਰੇਹਰਿਪ੍ਰੇਮਬਾਣੀਮਨੁਮਾਰਿਆ॥',
  'ਜਾਕੇਸੰਗਤੇਬੀਛੁਰਾਤਾਹੀਕੇਸੰਗਿਲਾਗੁ॥੧੨੯॥',
  'ਮਾਈਮੋਰੋਪ੍ਰੀਤਮੁਰਾਮੁਬਤਾਵਹੁਰੀਮਾਈ॥',
  'ਮੇਰੋਸੁੰਦਰੁਕਹਹੁਮਿਲੈਕਿਤੁਗਲੀ॥',
  'ਸੇਵੀਸਤਿਗੁਰੁਆਪਣਾਹਰਿਸਿਮਰੀਦਿਨਸਭਿਰੈਣ॥',
  'ਸ੍ਵਾਮੀਸਰਨਿਪਰਿਓਦਰਬਾਰੇ॥',
]


const SGGS_lst = require('./all_SGGS_pangits.json');
function findNonLarivaar(larivaarPangti) {
  const lp = larivaarPangti.trim();
  for (let i = 0; i < SGGS_lst.length; i++) {
    const pcP = SGGS_lst[i].replaceAll(' ', '').trim();
    if (pcP === lp) {
      return SGGS_lst[i]
    }
  }
  return null;
}

for (let i = 0; i < gurmukhiTitle.length; i++) {
  const padChed_line = findNonLarivaar(gurmukhiTitle[i])
  if (padChed_line) {
    console.log(padChed_line);
  }else{
    console.log('Not found:', gurmukhiTitle[i]);
  }
}
